Amiya200/stm32_water_tank/Core/Src/screen.c
/***************************************************************
 *  HELONIX Water Pump Controller
 *  SCREEN.C — FINAL SMOOTH VERSION (OPTION-2)
 *  WITH ENABLE/NO (UP=YES, DOWN=NO, SELECT=NEXT)
 ***************************************************************/

#include "screen.h"
#include "lcd_i2c.h"
#include "switches.h"
#include "model_handle.h"
#include "adc.h"
#include "rtc_i2c.h"
#include "acs712.h"
#include <stdio.h>
#include <string.h>
#include <stdbool.h>
#include <stdint.h>
#include "stm32f1xx_hal.h"

/* ================================================================
   UI ENUMS — ALL MODES + NEW TIMER / DEVICE MENUS
   ================================================================ */
typedef enum {
    UI_WELCOME = 0,
    UI_DASH,
    UI_MENU,

    /* Timer Editing Flow */
    UI_TIMER_SLOT_SELECT,
    UI_TIMER_EDIT_ON_TIME,
    UI_TIMER_EDIT_OFF_TIME,
    UI_TIMER_EDIT_DAYS,
    UI_TIMER_EDIT_GAP,
    UI_TIMER_EDIT_ENABLE,
    UI_TIMER_EDIT_SUMMARY,

    /* Auto Mode (kept for future use) */
    UI_AUTO_MENU,
    UI_AUTO_EDIT_GAP,
    UI_AUTO_EDIT_MAXRUN,
    UI_AUTO_EDIT_RETRY,

    /* Semi-Auto */
    UI_SEMI_AUTO,

    /* Twist Mode */
    UI_TWIST,
    UI_TWIST_EDIT_ON,
    UI_TWIST_EDIT_OFF,
    UI_TWIST_EDIT_ON_H,
    UI_TWIST_EDIT_ON_M,
    UI_TWIST_EDIT_OFF_H,
    UI_TWIST_EDIT_OFF_M,

    /* Countdown */
    UI_COUNTDOWN,
    UI_COUNTDOWN_EDIT_MIN,

    /* Device Setup (Settings) – scroll menu + per-item editors */
    UI_DEVSET_MENU,

    UI_SETTINGS_GAP,
    UI_SETTINGS_RETRY,
    UI_SETTINGS_UV,
    UI_SETTINGS_OV,
    UI_SETTINGS_OL,
    UI_SETTINGS_UL,
    UI_SETTINGS_MAXRUN,
    UI_SETTINGS_PWRREST,
    UI_SETTINGS_FACTORY,

    /* Date / Time / Day editors */
    UI_DEVSET_EDIT_DATE,
    UI_DEVSET_EDIT_TIME,
    UI_DEVSET_EDIT_DAY,

    /* Add New Device Submenus */
    UI_ADD_DEVICE_MENU,
    UI_ADD_DEVICE_PAIR,
    UI_ADD_DEVICE_REMOVE,
    UI_ADD_DEVICE_PAIR_DONE,
    UI_ADD_DEVICE_REMOVE_DONE,

    /* Reset confirm from main menu */
    UI_RESET_CONFIRM,

    UI_NONE,
    UI_MAX_
} UiState;

/* ================================================================
   BUTTON ENUMS — Clean, stable
   ================================================================ */
typedef enum {
    BTN_NONE = 0,
    BTN_RESET,
    BTN_SELECT,
    BTN_UP,
    BTN_DOWN,

    BTN_RESET_LONG,
    BTN_SELECT_LONG,
    BTN_UP_LONG,
    BTN_DOWN_LONG
} UiButton;

/* ================================================================
   GLOBAL UI VARIABLES
   ================================================================ */
static UiState ui      = UI_WELCOME;
static UiState last_ui = UI_NONE;

static bool screenNeedsRefresh = false;
static bool cursorVisible = true;

static uint32_t lastCursorToggle   = 0;
static uint32_t lastLcdUpdateTime  = 0;
static uint32_t lastUserAction     = 0;

#define WELCOME_MS         2500
#define CURSOR_BLINK_MS     400
#define AUTO_BACK_MS      60000

#define LONG_PRESS_MS      3000
#define CONTINUOUS_STEP_MS  250   // smoother experience
#define COUNTDOWN_INC_MS   2000
/* Backup values for enable/disable toggle */
static uint16_t bk_gap = 10;
static uint8_t  bk_retry = 3;
static uint16_t bk_uv = 180;
static uint16_t bk_ov = 260;
static int      bk_ol = 6;
static int      bk_ul = 2;
static uint16_t bk_maxrun = 120;

/* Button press tracking */
static uint32_t sw_press_start[4] = {0,0,0,0};
static bool     sw_long_issued[4] = {false,false,false,false};

static uint32_t last_repeat_time = 0;

/* For reset confirm screen */
static bool reset_confirm_yes = false;

/* ================================================================
   EXTERNAL STATES (from model_handle / rtc_i2c)
   ================================================================ */
extern ADC_Data adcData;
extern TimerSlot timerSlots[5];
extern TwistSettings twistSettings;
extern RTC_Time_t time;   /* global RTC time struct from rtc_i2c.c */

extern volatile bool manualActive;
extern volatile bool semiAutoActive;
extern volatile bool timerActive;
extern volatile bool countdownActive;
extern volatile bool twistActive;
extern volatile bool autoActive;
extern volatile uint32_t countdownDuration;

/* ================================================================
   NEW TIMER EDIT VARIABLES — CLEAN + FIXED
   ================================================================ */
static uint8_t edit_on_h = 0;
static uint8_t edit_on_m = 0;

static uint8_t edit_off_h = 0;
static uint8_t edit_off_m = 0;

static uint8_t time_edit_field = 0; // 0 = HH, 1 = MM

/* Days mask & selection index */
static uint8_t edit_day_mask = 0x7F; // default 7 days ON
static uint8_t edit_day_index = 0;   // 0..9

/* Slot gap time (min) */
static uint8_t edit_gap_min = 0;

/* Enable/Disable slot */
static bool edit_slot_enabled = true;

/* Which slot is being edited? 0..4, 5=Back */
static uint8_t currentSlot = 0;

/* Slot page: 0 → T1/T2, 1 → T3/T4, 2 → T5/BACK */
static uint8_t timer_page = 0;

/* ================================================================
   AUTO / TWIST / COUNTDOWN / SETTINGS TEMP VARS
   ================================================================ */
static uint16_t edit_auto_gap_s      = 60;
static uint16_t edit_auto_maxrun_min = 120;
static uint16_t edit_auto_retry      = 0;

static uint16_t edit_twist_on_s  = 5;
static uint16_t edit_twist_off_s = 5;

static uint8_t edit_twist_on_hh  = 6;
static uint8_t edit_twist_on_mm  = 0;
static uint8_t edit_twist_off_hh = 18;
static uint8_t edit_twist_off_mm = 0;

static uint16_t edit_countdown_min = 1;

/* SETTINGS (Device Setup) – core values that actually map to model_handle */
/* NOTE: edit_settings_gap_s now holds MINUTES (0=Disable, 1..15)  */
static uint16_t edit_settings_gap_s = 10;   // Dry run gap (min)
/* Testing gap / retry count now 0=Disable, 1..180min (UI side)    */
static uint8_t  edit_settings_retry = 3;
/* Low / High Volt: 0=Disable, else 150–200 / 250–300V             */
static uint16_t edit_settings_uv    = 180;  // Low volt
static uint16_t edit_settings_ov    = 260;  // High volt
uint8_t akg = 0 ;
/* Over/Under load: 0=Disable, else A (0.1 step) with clamping     */
static int edit_settings_ol = 6;       // Overload (A) change to int
static int edit_settings_ul = 0;       // Underload (A) change to int

/* Max run in minutes: 0=Disable, 10..300                          */
static uint16_t edit_settings_maxrun = 120;
static uint8_t  edit_settings_pwrrest = 0;   // 0=YES,1=NO,2=LAST
static bool     edit_settings_factory_yes = false;

/* ================================================================
   DATE / TIME / DAY EDIT (Device Setup)
   ================================================================ */
static uint8_t  edit_date_dd    = 1;
static uint8_t  edit_date_mm    = 1;
static uint16_t edit_date_yyyy  = 2025;
static uint8_t  edit_date_field = 0;  // 0=DD,1=MM,2=YY

