Amiya200/stm32_water_tank/Core/Src/screen.c
static uint8_t  edit_time_hh    = 0;
static uint8_t  edit_time_min   = 0;
static uint8_t  edit_time_field = 0;  // 0=HH,1=MM

/* Day index 0..6 -> Sun..Sat */
static uint8_t  edit_day_idx2   = 0;
static const char* const dowNames[7] = {
    "Sun","Mon","Tue","Wed","Thu","Fri","Sat"
};

/* ================================================================
   ADD NEW DEVICE STATE
   ================================================================ */
static uint8_t addDevMenuIndex  = 0; // 0=Pair Device, 1=Remove Device
static uint8_t addDevTypeIndex  = 0; // 0=Wi-Fi, 1=Receiver, 2=Transmitter
static uint8_t lastAddDevType   = 0; // for "Paired/Removed <type>"
static bool    lastAddActionPair = true;

static const char* const addDevTypeNames[] = {
    "Wi-Fi",
    "Receiver",
    "Transmitter"
};

/* ================================================================
   MAIN MENU ITEMS (as per document)
   ================================================================ */
static const char* const main_menu[] = {
    "Add New Device",    // 1
    "Device Setup",      // 2
    "Reset To Default"   // 3
};
#define MAIN_MENU_COUNT 3

static uint8_t menu_idx      = 0;
static uint8_t menu_view_top = 0;

/* ================================================================
   DEVICE SETUP SCROLL MENU
   (Mapped to individual edit screens)
   ================================================================ */
static const char* const devset_menu_items[] = {
    "Dry Run",     // -> UI_SETTINGS_GAP
    "Testing Gap", // -> UI_SETTINGS_RETRY
    "Low Volt",    // -> UI_SETTINGS_UV
    "High Volt",   // -> UI_SETTINGS_OV
    "Over Load",   // -> UI_SETTINGS_OL
    "Under Load",  // -> UI_SETTINGS_UL
    "Max Run",     // -> UI_SETTINGS_MAXRUN
    "Set Date",        // -> UI_DEVSET_EDIT_DATE
    "Set Time",        // -> UI_DEVSET_EDIT_TIME
    "Set Day",         // -> UI_DEVSET_EDIT_DAY
    "Power Restore",   // -> UI_SETTINGS_PWRREST
    "Factory Reset",   // -> UI_SETTINGS_FACTORY
    "Back"             // -> Back to Main Menu
};
#define DEVSET_MENU_COUNT  (sizeof(devset_menu_items)/sizeof(devset_menu_items[0]))

static uint8_t devset_idx      = 0;
static uint8_t devset_view_top = 0;

/* ================================================================ */

void Screen_Init(void)
{
    lcd_init();
    lcd_clear();

    ui = UI_WELCOME;
    last_ui = UI_NONE;

    screenNeedsRefresh = true;
    lastUserAction = HAL_GetTick();
}

/* ================================================================
   LCD Helpers — Safe, clean
   ================================================================ */
static inline void refreshInactivityTimer(void){
    lastUserAction = HAL_GetTick();
}

static inline void lcd_line(uint8_t row, const char* s){
    char buf[17];
    snprintf(buf, sizeof(buf), "%-16.16s", s);
    lcd_put_cur(row,0);
    lcd_send_string(buf);
}

static inline void lcd_line0(const char* s){ lcd_line(0,s); }
static inline void lcd_line1(const char* s){ lcd_line(1,s); }

/* ================================================================
   UI DRAWING FUNCTIONS
   ================================================================ */

/***************************************************************
 *  WELCOME SCREEN
 ***************************************************************/
static void show_welcome(void)
{
    lcd_clear();
    lcd_line0("   HELONIX");
    lcd_line1(" IntelligentSys");
}

/***************************************************************
 *  DASHBOARD SCREEN
 ***************************************************************/

static uint8_t dash_page = 0;
static uint32_t dash_cycle_start = 0;

#define DASH_PAGE1_TIME 20000   // 10 sec
#define DASH_PAGE2_TIME 5000    // 5 sec
#define DASH_PAGE3_TIME 5000    // 5 sec


static void show_dash(void)
{
    char l0[17], l1[17];
    uint32_t now = HAL_GetTick();

    /* Initialize cycle start */
    if (dash_cycle_start == 0)
        dash_cycle_start = now;

    uint32_t elapsed = now - dash_cycle_start;

    /* Page Rotation Logic */
    if (elapsed < DASH_PAGE1_TIME)
        dash_page = 0;
    else if (elapsed < (DASH_PAGE1_TIME + DASH_PAGE2_TIME))
        dash_page = 1;
    else if (elapsed < (DASH_PAGE1_TIME + DASH_PAGE2_TIME + DASH_PAGE3_TIME))
        dash_page = 2;
    else
    {
        dash_cycle_start = now;
        dash_page = 0;
    }

    /* ---------------- Tank Level ---------------- */
    int submerged = 0;
    for (int i = 0; i <= 3; i++)   // ONLY tank sensors
    {
        if (adcData.voltages[i] < 0.1f)
            submerged++;
    }


    int tankPercent = (submerged * 100) / 4;


    /* ---------------- Mode ---------------- */
    const char* mode =
        manualActive    ? "MANUL" :
        semiAutoActive  ? "SEMI " :
        timerActive     ? "TIMER" :
        countdownActive ? "COUNT" :
        twistActive     ? "TWIST" :
        autoActive      ? "AUTO " : "IDLE ";

    bool motorOn = Motor_GetStatus();

    /* ==================== PAGE 1 : STATUS ==================== */
    if (dash_page == 0)
    {
        /* Line 0 */
        snprintf(l0, sizeof(l0), "M:%s %-5s %3d%%",
                 motorOn ? "ON " : "OFF",
                 mode,
                 tankPercent);

        /* Ground Water status (ADC1)
         * YES when value == 0, else NO
         */
        const char *gw =
            (adcData.voltages[4] <= 0.01f) ? "YES" : "NO ";

        const char *dry =
            (adcData.voltages[5] <= 0.01f) ? "YES" : "NO ";


        /* Line 1 : BOTH statuses always visible */
        snprintf(l1, sizeof(l1), "G.W:%s DRY:%s", gw, dry);

    }

    /* ==================== PAGE 2 : DATE / TIME ==================== */
    else if (dash_page == 1)
    {
        snprintf(l0, sizeof(l0), "Date:%02u-%02u-%02u",
                 time.dom,
                 time.month,
                 (uint8_t)(time.year % 100));

        snprintf(l1, sizeof(l1), "Time:%02u:%02u:%02u",
                 time.hour,
                 time.min,
                 time.sec);
    }

    /* ==================== PAGE 3 : LIVE MONITOR ==================== */
    else
    {
        snprintf(l0, sizeof(l0), "V:%3.0fV  I:%3.1fA",
                 g_voltageV,
                 g_currentA);

