Amiya200/stm32_water_tank/Core/Src/screen.c
        if (ModelHandle_IsOverload())
            snprintf(l1, sizeof(l1), "OVER LOAD!");
        else if (ModelHandle_IsUnderload())
            snprintf(l1, sizeof(l1), "UNDER LOAD!");
        else if (ModelHandle_IsVoltageFault())
            snprintf(l1, sizeof(l1), "VOLT FAULT!");
        else
            snprintf(l1, sizeof(l1), "Live Monitor");
    }

    lcd_line0(l0);
    lcd_line1(l1);
}



/***************************************************************
 *  MAIN MENU DRAW
 ***************************************************************/
static void draw_menu_cursor(void)
{
    if (ui != UI_MENU) return;

    uint8_t row = 255;
    if      (menu_idx == menu_view_top)     row = 0;
    else if (menu_idx == menu_view_top + 1) row = 1;

    if (row <= 1)
    {
        lcd_put_cur(row,0);
        lcd_send_data(cursorVisible ? '>' : ' ');
    }
}

static void show_menu(void)
{
    char l0[17], l1[17];

    /* Adjust top-of-view */
    if (menu_idx < menu_view_top)
        menu_view_top = menu_idx;
    else if (menu_idx > menu_view_top + 1)
        menu_view_top = menu_idx - 1;

    snprintf(l0, sizeof(l0), " %-15.15s", main_menu[menu_view_top]);

    if (menu_view_top + 1 < MAIN_MENU_COUNT)
        snprintf(l1, sizeof(l1), " %-15.15s", main_menu[menu_view_top + 1]);
    else
        snprintf(l1, sizeof(l1), "                ");

    lcd_line0(l0);
    lcd_line1(l1);

    draw_menu_cursor();
}

/***************************************************************
 *  DEVICE SETUP MENU DRAW (scrolling cursor)
 ***************************************************************/
static void show_devset_menu(void)
{
    char l0[17], l1[17];

    /* Adjust scroll window */
    if (devset_idx < devset_view_top)
        devset_view_top = devset_idx;
    else if (devset_idx > devset_view_top + 1)
        devset_view_top = devset_idx - 1;

    uint8_t idx0 = devset_view_top;
    uint8_t idx1 = devset_view_top + 1;

    char star0 = ' ';
    char star1 = ' ';

    /* Enabled logic */
    if (idx0 == 0 && edit_settings_gap_s > 0)     star0 = '*';
    if (idx0 == 1 && edit_settings_retry > 0)     star0 = '*';
    if (idx0 == 2 && edit_settings_uv > 0)        star0 = '*';
    if (idx0 == 3 && edit_settings_ov > 0)        star0 = '*';
    if (idx0 == 4 && edit_settings_ol > 0)        star0 = '*';
    if (idx0 == 5 && edit_settings_ul > 0)        star0 = '*';
    if (idx0 == 6 && edit_settings_maxrun > 0)    star0 = '*';

    if (idx1 == 0 && edit_settings_gap_s > 0)     star1 = '*';
    if (idx1 == 1 && edit_settings_retry > 0)     star1 = '*';
    if (idx1 == 2 && edit_settings_uv > 0)        star1 = '*';
    if (idx1 == 3 && edit_settings_ov > 0)        star1 = '*';
    if (idx1 == 4 && edit_settings_ol > 0)        star1 = '*';
    if (idx1 == 5 && edit_settings_ul > 0)        star1 = '*';
    if (idx1 == 6 && edit_settings_maxrun > 0)    star1 = '*';

    if (idx0 < DEVSET_MENU_COUNT)
        snprintf(l0, sizeof(l0), "%c%c%-14.14s",
                 (devset_idx == idx0 ? '>' : ' '),
                 star0,
                 devset_menu_items[idx0]);
    else
        snprintf(l0, sizeof(l0), "                ");

    if (idx1 < DEVSET_MENU_COUNT)
        snprintf(l1, sizeof(l1), "%c%c%-14.14s",
                 (devset_idx == idx1 ? '>' : ' '),
                 star1,
                 devset_menu_items[idx1]);
    else
        snprintf(l1, sizeof(l1), "                ");

    lcd_line0(l0);
    lcd_line1(l1);
}

/***************************************************************
 *  TIMER MODE — TIMER SELECT
 ***************************************************************/
static void show_timer_slot_select(void)
{
    lcd_clear();

    /* Map page → timer indexes */
    int item1 = timer_page * 2;
    int item2 = item1 + 1;

    char l0[17], l1[17];

    /* Line0 */
    if (item1 == 5) {
        snprintf(l0, sizeof(l0), "%c Back",
                 (currentSlot == 5 ? '>' : ' '));
    }
    else {
        snprintf(l0, sizeof(l0), "%c Timer %d",
                 (currentSlot == item1 ? '>' : ' '),
                 item1 + 1);
    }

    /* Line1 */
    if (item2 <= 5)
    {
        if (item2 == 5) {
            snprintf(l1, sizeof(l1), "%c Back",
                     (currentSlot == 5 ? '>' : ' '));
        } else {
            snprintf(l1, sizeof(l1), "%c Timer %d",
                     (currentSlot == item2 ? '>' : ' '),
                     item2 + 1);
        }
    }
    else {
        snprintf(l1, sizeof(l1), "                ");
    }

    lcd_line0(l0);
    lcd_line1(l1);
}

/***************************************************************
 *  TIMER — EDIT ON TIME
 ***************************************************************/
static void show_edit_on_time(void)
{
    char title[17];
    snprintf(title, sizeof(title), "T%u On Time", (unsigned)(currentSlot + 1));
    lcd_line0(title);

    char buf[17];
    if (time_edit_field == 0)
        snprintf(buf, sizeof(buf), "[%02d]:%02d   Next>", edit_on_h, edit_on_m);
    else
        snprintf(buf, sizeof(buf), "%02d:[%02d]   Next>", edit_on_h, edit_on_m);

    lcd_line1(buf);
}

/***************************************************************
 *  TIMER — EDIT OFF TIME
 ***************************************************************/
static void show_edit_off_time(void)
{
    char title[17];
    snprintf(title, sizeof(title), "T%u Off Time", (unsigned)(currentSlot + 1));
    lcd_line0(title);

    char buf[17];
    if (time_edit_field == 0)
        snprintf(buf, sizeof(buf), "[%02d]:%02d   Next>", edit_off_h, edit_off_m);
    else
        snprintf(buf, sizeof(buf), "%02d:[%02d]   Next>", edit_off_h, edit_off_m);

    lcd_line1(buf);
}

/***************************************************************
 *  TIMER — DAYS MENU
 ***************************************************************/
static const char* dayNames[] = {
    "Enable All", "Disable All",
    "Mon", "Tue", "Wed", "Thu", "Fri", "Sat", "Sun",
    "Next>"
};

static void show_timer_days(void)
{
    lcd_line0("Timer Days");

    char buf[17];

