Amiya200/stm32_water_tank/Core/Src/screen.c
    if (edit_day_index >= 2 && edit_day_index <= 8)
        {
            uint8_t d = edit_day_index - 2;
            uint8_t isOn = (edit_day_mask >> d) & 1;
            snprintf(buf,sizeof(buf),"> %s (%s)", dayNames[edit_day_index], isOn?"ON":"OFF");
        }
        else
        {
            snprintf(buf,sizeof(buf),"> %s", dayNames[edit_day_index]);
        }


    lcd_line1(buf);
}

/***************************************************************
 *  TIMER — GAP (min)
 ***************************************************************/
static void show_timer_gap(void)
{
    lcd_line0("Timer Gap (min)");

    char buf[17];
    snprintf(buf, sizeof(buf), ">T%u %3u min Next>",
             (unsigned)(currentSlot + 1),
             (unsigned)edit_gap_min);

    lcd_line1(buf);
}

/***************************************************************
 *  TIMER — ENABLE / DISABLE
 ***************************************************************/
static void show_timer_enable(void)
{
    char title[17];
    snprintf(title, sizeof(title), "T%u Enable?",
             (unsigned)(currentSlot + 1));
    lcd_line0(title);
    lcd_line1(edit_slot_enabled ? "YES       Next>" :
                                  "NO        Next>");
}

/***************************************************************
 *  TIMER — SUMMARY
 ***************************************************************/
static void show_timer_summary(void)
{
akg =1;
    char title[17];
    snprintf(title, sizeof(title), "T%u Summary",
             (unsigned)(currentSlot + 1));
    lcd_line0(title);

    if (edit_slot_enabled)
        lcd_line1("Enabled     Next>");
    else
        lcd_line1("Disabled    Next>");
}

/***************************************************************
 *  AUTO MODE (kept)
 ***************************************************************/
static void show_auto_menu(void)
{
    lcd_line0("Auto Settings");
    lcd_line1(">Gap/Max/Retry");
}

static void show_auto_gap(void){
    lcd_line0("DRY GAP (s)");
    char buf[17]; snprintf(buf,sizeof(buf),"val:%03u Next>",edit_auto_gap_s);
    lcd_line1(buf);
}
static void show_auto_maxrun(void){
    lcd_line0("MAX RUN (min)");
    char buf[17]; snprintf(buf,sizeof(buf),"val:%03u Next>",edit_auto_maxrun_min);
    lcd_line1(buf);
}
static void show_auto_retry(void){
    lcd_line0("RETRY COUNT");
    char buf[17]; snprintf(buf,sizeof(buf),"val:%03u Next>",edit_auto_retry);
    lcd_line1(buf);
}

/***************************************************************
 *  SEMI-AUTO UI
 ***************************************************************/
static void show_semi_auto(void)
{
    lcd_line0("Semi-Auto");
    lcd_line1(semiAutoActive ? "val:Disable Next>"
                             : "val:Enable  Next>");
}

/***************************************************************
 *  TWIST MODE UI
 ***************************************************************/
static void show_twist(void)
{
    char l0[17];
    snprintf(l0,sizeof(l0),"Tw %02us/%02us",
             (unsigned)twistSettings.onDurationSeconds,
             (unsigned)twistSettings.offDurationSeconds);

    lcd_line0(l0);
    lcd_line1(twistActive ?  "val:STOP   Next>" :
                            "val:START  Next>");
}

static void show_twist_on_sec(void){
    lcd_line0("TWIST ON SEC");
    char buf[17]; snprintf(buf,sizeof(buf),"val:%03u Next>",edit_twist_on_s);
    lcd_line1(buf);
}
static void show_twist_off_sec(void){
    lcd_line0("TWIST OFF SEC");
    char buf[17]; snprintf(buf,sizeof(buf),"val:%03u Next>",edit_twist_off_s);
    lcd_line1(buf);
}
static void show_twist_on_h(void){
    lcd_line0("TWIST ON HH");
    char buf[17]; snprintf(buf,sizeof(buf),"val:%03u Next>",edit_twist_on_hh);
    lcd_line1(buf);
}
static void show_twist_on_m(void){
    lcd_line0("TWIST ON MM");
    char buf[17]; snprintf(buf,sizeof(buf),"val:%03u Next>",edit_twist_on_mm);
    lcd_line1(buf);
}
static void show_twist_off_h(void){
    lcd_line0("TWIST OFF HH");
    char buf[17]; snprintf(buf,sizeof(buf),"val:%03u Next>",edit_twist_off_hh);
    lcd_line1(buf);
}
static void show_twist_off_m(void){
    lcd_line0("TWIST OFF MM");
    char buf[17]; snprintf(buf,sizeof(buf),"val:%03u Next>",edit_twist_off_mm);
    lcd_line1(buf);
}

/***************************************************************
 *  COUNTDOWN UI
 ***************************************************************/
static void show_countdown(void)
{
    char l0[17], l1[17];

    if (countdownActive)
    {
        uint32_t sec = countdownDuration;
        uint32_t min = sec / 60;
        uint32_t s   = sec % 60;

        snprintf(l0,sizeof(l0),"CD %02lu:%02lu RUN",
                 (unsigned long)min, (unsigned long)s);
        snprintf(l1,sizeof(l1),"Press to STOP");
    }
    else
    {
        snprintf(l0,sizeof(l0),"CD Set:%3u min",edit_countdown_min);
        snprintf(l1,sizeof(l1),"Press to START");
    }

    lcd_line0(l0);
    lcd_line1(l1);
}

static void show_countdown_edit_min(void){
    lcd_line0("SET MINUTES");
    char buf[17]; snprintf(buf,sizeof(buf),"val:%03u Next>",edit_countdown_min);
    lcd_line1(buf);
}

/***************************************************************
 *  DEVICE SETUP (SETTINGS) UI
 ***************************************************************/
/* Dry Run: 0=Disable, 1..15 min */
static void show_settings_gap(void){
    lcd_line0("Set Dry Run");
    char buf[17];
    if (edit_settings_gap_s == 0)
        snprintf(buf,sizeof(buf),"Disable    Next>");
    else
        snprintf(buf,sizeof(buf),"val:%2umin Next>", edit_settings_gap_s);
    lcd_line1(buf);
}

/* Testing Gap: 0=Disable, 1..180min */
static void show_settings_retry(void){
    lcd_line0("Testing Gap");
    char buf[17];
    if (edit_settings_retry == 0)
        snprintf(buf,sizeof(buf),"Disable    Next>");
    else
        snprintf(buf,sizeof(buf),"val:%3umin Next>", edit_settings_retry);
    lcd_line1(buf);
}

/* Low Volt: 0=Disable, else 150–200V */
static void show_settings_uv(void){
    lcd_line0("Low Volt");
    char buf[17];
    if (edit_settings_uv == 0)
        snprintf(buf,sizeof(buf),"Disable    Next>");
    else
        snprintf(buf,sizeof(buf),"val:%3uV Next>", edit_settings_uv);
    lcd_line1(buf);
}

