Amiya200/stm32_water_tank/Core/Src/screen.c
/* High Volt: 0=Disable, else 250–300V */
static void show_settings_ov(void){
    lcd_line0("High Volt");
    char buf[17];
    if (edit_settings_ov == 0)
        snprintf(buf,sizeof(buf),"Disable    Next>");
    else
        snprintf(buf,sizeof(buf),"val:%3uV Next>", edit_settings_ov);
    lcd_line1(buf);
}

/* Over Load: 0=Disable, else up to 25A */
/* Over Load: 0=Disable, else up to 25A */
static void show_settings_ol(void){
    lcd_line0("Over Load (A)");
    char buf[17];
    if (edit_settings_ol < 1)
        snprintf(buf, sizeof(buf), "Disable    Next>");
    else
        snprintf(buf, sizeof(buf), "val:%3d Next>", edit_settings_ol);
    lcd_line1(buf);
}
/* Under Load: 0=Disable, else up to 10A */
/* Under Load: 0=Disable, else up to 10A */
static void show_settings_ul(void){
    lcd_line0("Under Load (A)");
    char buf[17];
    if (edit_settings_ul < 1)
        snprintf(buf, sizeof(buf), "Disable    Next>");
    else
        snprintf(buf, sizeof(buf), "val:%3d Next>", edit_settings_ul);
    lcd_line1(buf);
}

/* Max Run: 0=Disable, else 10–300min */
static void show_settings_maxrun(void){
    lcd_line0("Max Run");
    char buf[17];
    if (edit_settings_maxrun == 0)
        snprintf(buf,sizeof(buf),"Disable    Next>");
    else
        snprintf(buf,sizeof(buf),"val:%3umin Next>",edit_settings_maxrun);
    lcd_line1(buf);
}

/* Power Restore: YES / NO / LAST */
static void show_settings_pwrrest(void){
    lcd_line0("Power Restore");
    const char* text =
        (edit_settings_pwrrest == 0) ? "YES       Next>" :
        (edit_settings_pwrrest == 1) ? "NO        Next>" :
                                       "LAST      Next>";
    lcd_line1(text);
}

static void show_settings_factory(void){
    lcd_line0("Factory Reset?");
    lcd_line1(edit_settings_factory_yes ? "YES       Next>" :
                                         "NO        Next>");
}

/***************************************************************
 *  DEVICE SETUP — DATE/TIME/DAY SCREENS
 ***************************************************************/
static void show_devset_edit_date(void)
{
    lcd_line0("Set Date");

    uint8_t yy2 = (uint8_t)(edit_date_yyyy % 100);
    char buf[17];

    if (edit_date_field == 0)
        snprintf(buf,sizeof(buf),"[%02u]-%02u-%02u", edit_date_dd, edit_date_mm, yy2);
    else if (edit_date_field == 1)
        snprintf(buf,sizeof(buf),"%02u-[%02u]-%02u", edit_date_dd, edit_date_mm, yy2);
    else
        snprintf(buf,sizeof(buf),"%02u-%02u-[%02u]", edit_date_dd, edit_date_mm, yy2);

    lcd_line1(buf);
}

static void show_devset_edit_time(void)
{
    lcd_line0("Set Time");
    char buf[17];

    if (edit_time_field == 0)
        snprintf(buf,sizeof(buf),"[%02u]:%02u", edit_time_hh, edit_time_min);
    else
        snprintf(buf,sizeof(buf),"%02u:[%02u]", edit_time_hh, edit_time_min);

    lcd_line1(buf);
}

static void show_devset_edit_day(void)
{
    lcd_line0("Set Day");
    char buf[17];
    snprintf(buf,sizeof(buf),"> %s", dowNames[edit_day_idx2 % 7]);
    lcd_line1(buf);
}

/***************************************************************
 *  ADD NEW DEVICE — UI
 ***************************************************************/
static void show_add_device_menu(void)
{
    lcd_line0(addDevMenuIndex == 0 ? ">Pair Device" : " Pair Device");
    lcd_line1(addDevMenuIndex == 1 ? ">Remove Device" : " Remove Device");
}

static void show_add_device_pair(void)
{
    lcd_line0("Pair Device");
    char buf[17];
    snprintf(buf,sizeof(buf),">%s", addDevTypeNames[addDevTypeIndex]);
    lcd_line1(buf);
}

static void show_add_device_remove(void)
{
    lcd_line0("Remove Device");
    char buf[17];
    snprintf(buf,sizeof(buf),">%s", addDevTypeNames[addDevTypeIndex]);
    lcd_line1(buf);
}

static void show_add_device_pair_done(void)
{
    lcd_line0("Paired Device");
    char buf[17];
    snprintf(buf,sizeof(buf),"%s   OK>", addDevTypeNames[lastAddDevType]);
    lcd_line1(buf);
}

static void show_add_device_remove_done(void)
{
    lcd_line0("Removed Device");
    char buf[17];
    snprintf(buf,sizeof(buf),"%s   OK>", addDevTypeNames[lastAddDevType]);
    lcd_line1(buf);
}

/***************************************************************
 *  RESET TO DEFAULT — CONFIRM
 ***************************************************************/
static void show_reset_confirm(void)
{
    lcd_line0("Reset To Default?");
    lcd_line1(reset_confirm_yes ? "YES       Apply>" :
                                  "NO        Back>");
}

/* ================================================================
   APPLY FUNCTIONS
   ================================================================ */
static void apply_timer_slot(void)
{
    TimerSlot *t = &timerSlots[currentSlot];
akg=2;
    t->onHour    = edit_on_h;
    t->onMinute  = edit_on_m;
    t->offHour   = edit_off_h;
    t->offMinute = edit_off_m;
    t->dayMask   = edit_day_mask;
    t->gapMinutes = edit_gap_min;
    t->enabled = edit_slot_enabled;

    extern void ModelHandle_TimerRecalculateNow(void);
    ModelHandle_TimerRecalculateNow();
}

static void apply_auto_settings(void)
{
    ModelHandle_SetAutoSettings(
        edit_auto_gap_s,
        edit_auto_maxrun_min,
        edit_auto_retry
    );
}

/* Apply current Device Setup core settings into model */
static void apply_settings_core(void)
{
    /* Convert UI dry-run minutes to seconds; 0 = disabled */
    uint16_t gap_s = 0;
    if (edit_settings_gap_s > 0)
        gap_s = (uint16_t)(edit_settings_gap_s * 60U);

    ModelHandle_SetUserSettings(
        gap_s,
        edit_settings_retry,
        edit_settings_uv,
        edit_settings_ov,
        edit_settings_ol,
        edit_settings_ul,
        edit_settings_maxrun
    );
}

/***************************************************************
 *  SETTINGS FLOW — START (Device Setup)
 *  Load all values + RTC into local edit variables and go to
 *  Device Setup scroll menu.
 ***************************************************************/
static void start_settings_edit_flow(void)
{
    /* Load fresh settings from model */
    uint16_t gap_s = ModelHandle_GetGapTime();
    if (gap_s == 0) {
        edit_settings_gap_s = 0;
    } else {
        edit_settings_gap_s = gap_s / 60;
        if (edit_settings_gap_s < 1)  edit_settings_gap_s = 1;
        if (edit_settings_gap_s > 15) edit_settings_gap_s = 15;
    }

