Amiya200/stm32_water_tank/Core/Src/screen.c
    edit_settings_retry   = ModelHandle_GetRetryCount();
    if (edit_settings_retry > 180)
        edit_settings_retry = 180;

    edit_settings_uv      = ModelHandle_GetUnderVolt();
    if (edit_settings_uv != 0) {    // 0=Disable
        if (edit_settings_uv < 150) edit_settings_uv = 150;
        if (edit_settings_uv > 200) edit_settings_uv = 200;
    }

    edit_settings_ov      = ModelHandle_GetOverVolt();
    if (edit_settings_ov != 0) {    // 0=Disable
        if (edit_settings_ov < 250) edit_settings_ov = 250;
        if (edit_settings_ov > 300) edit_settings_ov = 300;
    }

    edit_settings_ol      = ModelHandle_GetOverloadLimit();
    if (edit_settings_ol > 25.0f) edit_settings_ol = 25.0f;

    edit_settings_ul      = ModelHandle_GetUnderloadLimit();
    if (edit_settings_ul > 10.0f) edit_settings_ul = 10.0f;

    edit_settings_maxrun  = ModelHandle_GetMaxRunTime();
    if (edit_settings_maxrun > 300) edit_settings_maxrun = 300;

    /* Power Restore mode from model 0=YES,1=NO,2=LAST */
    edit_settings_pwrrest = ModelHandle_GetPowerRestoreMode();

    edit_settings_factory_yes = 0;

    /* Load current RTC date/time/day */
    RTC_GetTimeDate();

    edit_date_dd    = time.dom;
    edit_date_mm    = time.month;
    edit_date_yyyy  = time.year;
    edit_date_field = 0;

    edit_time_hh    = time.hour;
    edit_time_min   = time.min;
    edit_time_field = 0;

    /* DS1307 dow: 1..7; map to 0..6 index (Sun..Sat) */
    if (time.dow >= 1 && time.dow <= 7)
        edit_day_idx2 = (uint8_t)((time.dow - 1) % 7);
    else
        edit_day_idx2 = 0;

    devset_idx      = 0;
    devset_view_top = 0;

    ui = UI_DEVSET_MENU;
    screenNeedsRefresh = true;
}

/***************************************************************
 *  MENU SELECT — MAIN NAVIGATION + TIMER / SETTINGS
 ***************************************************************/
static void goto_menu_top(void)
{
    menu_idx = 0;
    menu_view_top = 0;
}

static void menu_select(void)
{
    refreshInactivityTimer();

    /* WELCOME → DASH */
    if (ui == UI_WELCOME)
    {
        ui = UI_DASH;
        screenNeedsRefresh = true;
        return;
    }

    /* DASH → MENU (also handled via long SELECT) */
    if (ui == UI_DASH)
    {
        goto_menu_top();
        ui = UI_MENU;
        screenNeedsRefresh = true;
        return;
    }

    /* MAIN MENU */
    if (ui == UI_MENU)
    {
        switch(menu_idx)
        {
            case 0:   /* ADD NEW DEVICE */
                addDevMenuIndex = 0;
                addDevTypeIndex = 0;
                ui = UI_ADD_DEVICE_MENU;
                screenNeedsRefresh = true;
                return;

            case 1:   /* DEVICE SETUP */
                start_settings_edit_flow();
                return;

            case 2:   /* RESET TO DEFAULT CONFIRM */
                reset_confirm_yes = false;
                ui = UI_RESET_CONFIRM;
                screenNeedsRefresh = true;
                return;
        }
    }


    /* TIMER SLOT SELECT → LOAD TIMER */
    if (ui == UI_TIMER_SLOT_SELECT)
        {
            if (currentSlot == 5)
            {
                ui = UI_MENU;  // BACK
                screenNeedsRefresh = true;
                return;
            }

            TimerSlot *t = &timerSlots[currentSlot];

            edit_on_h  = t->onHour;
            edit_on_m  = t->onMinute;
            edit_off_h = t->offHour;
            edit_off_m = t->offMinute;

            edit_day_mask = t->dayMask;
            edit_gap_min  = t->gapMinutes;
            edit_slot_enabled = t->enabled;

            time_edit_field = 0;
            edit_day_index  = 0;

            ui = UI_TIMER_EDIT_ON_TIME;
            screenNeedsRefresh = true;
            return;
        }


    /* TIMER EDIT FLOW SEQUENCE */
    switch(ui)
    {
        case UI_TIMER_EDIT_ON_TIME:
            if (time_edit_field == 0)
                time_edit_field = 1;
            else {
                time_edit_field = 0;
                ui = UI_TIMER_EDIT_OFF_TIME;
            }
            break;

        case UI_TIMER_EDIT_OFF_TIME:
            if (time_edit_field == 0)
                time_edit_field = 1;
            else {
                time_edit_field = 0;
                ui = UI_TIMER_EDIT_DAYS;
            }
            break;

        case UI_TIMER_EDIT_DAYS:
            if (edit_day_index == 9)
                ui = UI_TIMER_EDIT_GAP;
            else
                edit_day_index++;
            break;

        case UI_TIMER_EDIT_GAP:
            ui = UI_TIMER_EDIT_ENABLE;
            break;
        case UI_TIMER_EDIT_ENABLE:
            /* normal flow: save slot & back to slot list */
            apply_timer_slot();
            ui = UI_TIMER_SLOT_SELECT;
            break;

        case UI_TIMER_EDIT_SUMMARY:
            apply_timer_slot();
            ui = UI_TIMER_SLOT_SELECT;
            break;


        default:
            break;
    }

    screenNeedsRefresh = true;
}

/* ================================================================
   VALUE EDIT ENGINE
   ================================================================ */
void increase_edit_value(void)
{
    switch(ui)
    {
        /* TIMER ON TIME */
        case UI_TIMER_EDIT_ON_TIME:
            if (time_edit_field == 0) {
                if (edit_on_h <= 18) edit_on_h += 5;
                else edit_on_h = 23;
            } else {
                if (edit_on_m <= 54) edit_on_m += 5;
                else edit_on_m = 59;
            }
            break;

        /* TIMER OFF TIME */
        case UI_TIMER_EDIT_OFF_TIME:
            if (time_edit_field == 0) {
                if (edit_off_h <= 18) edit_off_h += 5;
                else edit_off_h = 23;
            } else {
                if (edit_off_m <= 54) edit_off_m += 5;
                else edit_off_m = 59;
            }
            break;

        /* TIMER GAP */
        case UI_TIMER_EDIT_GAP:
            if (edit_gap_min <= 235) edit_gap_min += 5;
            else edit_gap_min = 240;
            break;

        /* AUTO SETTINGS */
        case UI_AUTO_EDIT_GAP:      edit_auto_gap_s += 5; break;
        case UI_AUTO_EDIT_MAXRUN:   edit_auto_maxrun_min += 5; break;
        case UI_AUTO_EDIT_RETRY:    edit_auto_retry += 5; break;

