Amiya200/stm32_water_tank/Core/Src/screen.c
        /* TWIST MODE */
        case UI_TWIST_EDIT_ON:    edit_twist_on_s += 5; break;
        case UI_TWIST_EDIT_OFF:   edit_twist_off_s += 5; break;
        case UI_TWIST_EDIT_ON_H:
            if (edit_twist_on_hh <= 18) edit_twist_on_hh += 5;
            else edit_twist_on_hh = 23;
            break;
        case UI_TWIST_EDIT_ON_M:
            if (edit_twist_on_mm <= 54) edit_twist_on_mm += 5;
            else edit_twist_on_mm = 59;
            break;
        case UI_TWIST_EDIT_OFF_H:
            if (edit_twist_off_hh <= 18) edit_twist_off_hh += 5;
            else edit_twist_off_hh = 23;
            break;
        case UI_TWIST_EDIT_OFF_M:
            if (edit_twist_off_mm <= 54) edit_twist_off_mm += 5;
            else edit_twist_off_mm = 59;
            break;

        /* COUNTDOWN */
        case UI_COUNTDOWN_EDIT_MIN:
            if (edit_countdown_min <= 994) edit_countdown_min += 1;
            else edit_countdown_min = 999;
            break;

        /* SETTINGS */
        case UI_SETTINGS_GAP:
            if (edit_settings_gap_s <= 10) edit_settings_gap_s += 5;
            else edit_settings_gap_s = 15;
            break;

        case UI_SETTINGS_RETRY:
            if (edit_settings_retry <= 175) edit_settings_retry += 5;
            else edit_settings_retry = 180;
            break;

        case UI_SETTINGS_UV:
            if (edit_settings_uv == 0) edit_settings_uv = 150;
            else if (edit_settings_uv <= 195) edit_settings_uv += 5;
            else edit_settings_uv = 200;
            break;

        case UI_SETTINGS_OV:
            if (edit_settings_ov == 0) edit_settings_ov = 250;
            else if (edit_settings_ov <= 295) edit_settings_ov += 5;
            else edit_settings_ov = 300;
            break;

        case UI_SETTINGS_OL:
            if (edit_settings_ol <= 20) edit_settings_ol += 5;
            else edit_settings_ol = 25;
            break;

        case UI_SETTINGS_UL:
            if (edit_settings_ul <= 5) edit_settings_ul += 5;
            else edit_settings_ul = 10;
            break;

        case UI_SETTINGS_MAXRUN:
            if (edit_settings_maxrun == 0) edit_settings_maxrun = 10;
            else if (edit_settings_maxrun <= 295) edit_settings_maxrun += 5;
            else edit_settings_maxrun = 300;
            break;

        case UI_SETTINGS_PWRREST:
            edit_settings_pwrrest = (edit_settings_pwrrest + 1) % 3;
            break;

        case UI_SETTINGS_FACTORY:
            edit_settings_factory_yes ^= 1;
            break;

        /* DATE / TIME / DAY */
        case UI_DEVSET_EDIT_DATE:
            if (edit_date_field == 0) {
                if (edit_date_dd <= 26) edit_date_dd += 5;
                else edit_date_dd = 31;
            } else if (edit_date_field == 1) {
                if (edit_date_mm <= 7) edit_date_mm += 5;
                else edit_date_mm = 12;
            } else {
                if (edit_date_yyyy <= 2094) edit_date_yyyy += 5;
                else edit_date_yyyy = 2099;
            }
            break;

        case UI_DEVSET_EDIT_TIME:
            if (edit_time_field == 0) {
                if (edit_time_hh <= 18) edit_time_hh += 5;
                else edit_time_hh = 23;
            } else {
                if (edit_time_min <= 54) edit_time_min += 5;
                else edit_time_min = 59;
            }
            break;

        case UI_DEVSET_EDIT_DAY:
            edit_day_idx2 = (uint8_t)((edit_day_idx2 + 1) % 7);
            break;

        default:
            break;
    }
}

void decrease_edit_value(void)
{
    switch(ui)
    {
        case UI_TIMER_EDIT_ON_TIME:
            if (time_edit_field == 0) {
                if (edit_on_h >= 5) edit_on_h -= 5;
                else edit_on_h = 0;
            } else {
                if (edit_on_m >= 5) edit_on_m -= 5;
                else edit_on_m = 0;
            }
            break;

        case UI_TIMER_EDIT_OFF_TIME:
            if (time_edit_field == 0) {
                if (edit_off_h >= 5) edit_off_h -= 5;
                else edit_off_h = 0;
            } else {
                if (edit_off_m >= 5) edit_off_m -= 5;
                else edit_off_m = 0;
            }
            break;

        case UI_TIMER_EDIT_GAP:
            if (edit_gap_min >= 5) edit_gap_min -= 5;
            else edit_gap_min = 0;
            break;

        case UI_AUTO_EDIT_GAP:
            if (edit_auto_gap_s >= 5) edit_auto_gap_s -= 5;
            else edit_auto_gap_s = 0;
            break;

        case UI_AUTO_EDIT_MAXRUN:
            if (edit_auto_maxrun_min >= 5) edit_auto_maxrun_min -= 5;
            else edit_auto_maxrun_min = 0;
            break;

        case UI_AUTO_EDIT_RETRY:
            if (edit_auto_retry >= 5) edit_auto_retry -= 5;
            else edit_auto_retry = 0;
            break;

        case UI_SETTINGS_GAP:
            if (edit_settings_gap_s >= 5) edit_settings_gap_s -= 5;
            else edit_settings_gap_s = 0;
            break;

        case UI_SETTINGS_RETRY:
            if (edit_settings_retry >= 5) edit_settings_retry -= 5;
            else edit_settings_retry = 0;
            break;

        case UI_SETTINGS_OL:
            if (edit_settings_ol >= 5) edit_settings_ol -= 5;
            else edit_settings_ol = 0;
            break;

        case UI_SETTINGS_UL:
            if (edit_settings_ul >= 5) edit_settings_ul -= 5;
            else edit_settings_ul = 0;
            break;

        case UI_SETTINGS_MAXRUN:
            if (edit_settings_maxrun >= 15) edit_settings_maxrun -= 5;
            else edit_settings_maxrun = 0;
            break;

        case UI_DEVSET_EDIT_TIME:
            if (edit_time_field == 0) {
                if (edit_time_hh >= 5) edit_time_hh -= 5;
                else edit_time_hh = 0;
            } else {
                if (edit_time_min >= 5) edit_time_min -= 5;
                else edit_time_min = 0;
            }
            break;

        case UI_DEVSET_EDIT_DAY:
            edit_day_idx2 = (uint8_t)((edit_day_idx2 + 6) % 7);
            break;

        default:
            break;
    }
}

/***************************************************************
 *  BUTTON DECODER
 ***************************************************************/
static UiButton decode_button_press(void)
{
    bool sw[4] = {
        Switch_IsPressed(0),
        Switch_IsPressed(1),
        Switch_IsPressed(2),
        Switch_IsPressed(3)
    };

    uint32_t now = HAL_GetTick();
    UiButton out = BTN_NONE;

    for (int i = 0; i < 4; i++)
    {
        if (sw[i] && sw_press_start[i] == 0)
        {
            sw_press_start[i] = now;
            sw_long_issued[i] = false;
        }
        else if (!sw[i] && sw_press_start[i] != 0)
        {
            if (!sw_long_issued[i])
            {
                switch(i){
                    case 0: out = BTN_RESET;  break;
                    case 1: out = BTN_SELECT; break;
                    case 2: out = BTN_UP;     break;
                    case 3: out = BTN_DOWN;   break;
                }
            }
            sw_press_start[i] = 0;
            sw_long_issued[i] = false;
        }
        else if (sw[i] && !sw_long_issued[i])
        {
            if (now - sw_press_start[i] >= LONG_PRESS_MS)
            {
                sw_long_issued[i] = true;
                switch(i){
                    case 0: out = BTN_RESET_LONG;  break;
                    case 1: out = BTN_SELECT_LONG; break;
                    case 2: out = BTN_UP_LONG;     break;
                    case 3: out = BTN_DOWN_LONG;   break;
                }
            }
        }
    }
    return out;
}

/***************************************************************
 *  MAIN SWITCH HANDLER
 ***************************************************************/
/***************************************************************
 *  MAIN SWITCH HANDLER
 ***************************************************************/
void Screen_HandleSwitches(void)
{
    static bool prev_sw_down_edit = false;   /* track DOWN state in countdown edit */

    UiButton b = decode_button_press();
    uint32_t now = HAL_GetTick();

    bool sw_up   = Switch_IsPressed(2);
    bool sw_down = Switch_IsPressed(3);

    /* LONG PRESS RESET → manual toggle */
//    if (b == BTN_RESET_LONG)
//    {
//        ModelHandle_ToggleManual();
//        ui = UI_DASH;
//        screenNeedsRefresh = true;
//        return;
//    }

    /* CONTINUOUS UP (HOLD) */
    if (sw_up && sw_long_issued[2] && ui != UI_COUNTDOWN_EDIT_MIN)
    {
        if (now - last_repeat_time >= CONTINUOUS_STEP_MS)
        {
            last_repeat_time = now;

            if (ui == UI_MENU)
            {
                if (menu_idx > 0) menu_idx--;
            }
            else if (ui == UI_TIMER_SLOT_SELECT)
            {
                if (currentSlot > 0) currentSlot--;
                timer_page = (currentSlot < 2 ? 0 :
                             (currentSlot < 5 ? 1 : 2));
            }
            else if (ui == UI_DEVSET_MENU)
            {
                if (devset_idx > 0) devset_idx--;
            }
            else
            {
                /* Any edit screen (excluding countdown edit) */
                increase_edit_value();
            }

            screenNeedsRefresh = true;
        }
    }

    /* CONTINUOUS DOWN (HOLD) */
    if (sw_down && sw_long_issued[3] && ui != UI_COUNTDOWN_EDIT_MIN)
    {
        if (now - last_repeat_time >= CONTINUOUS_STEP_MS)
        {
            last_repeat_time = now;

            if (ui == UI_MENU)
            {
                if (menu_idx < MAIN_MENU_COUNT - 1) menu_idx++;
            }
            else if (ui == UI_TIMER_SLOT_SELECT)
            {
                if (currentSlot < 5) currentSlot++;
                timer_page = (currentSlot < 2 ? 0 :
                             (currentSlot < 5 ? 1 : 2));
            }
            else if (ui == UI_DEVSET_MENU)
            {
                if (devset_idx < DEVSET_MENU_COUNT - 1) devset_idx++;
            }
            else
            {
                /* Any edit screen (excluding countdown edit) */
                decrease_edit_value();
            }

            screenNeedsRefresh = true;
        }
    }

    /* ============================================
       COUNTDOWN EDIT: single DOWN button, press & hold
       - Entered via BTN_DOWN_LONG from DASH.
       - While DOWN is held: increase value periodically.
       - On release of DOWN: exit back to DASH.
       ============================================ */
    if (ui == UI_COUNTDOWN_EDIT_MIN)
    {
        if (sw_down)
        {
            /* first press → immediate step + start repeat timer */
            if (!prev_sw_down_edit)
            {
                last_repeat_time = now;
                increase_edit_value();
                screenNeedsRefresh = true;
            }
            else if (now - last_repeat_time >= CONTINUOUS_STEP_MS)
            {
                /* continuous increase while holding */
                last_repeat_time = now;
                increase_edit_value();
                screenNeedsRefresh = true;
            }
        }

        /* detect release → leave edit mode */
        if (!sw_down && prev_sw_down_edit)
        {
            ui = UI_DASH;
            screenNeedsRefresh = true;
        }

        prev_sw_down_edit = sw_down;
        return;
    }
    else
    {
        /* not in countdown edit → reset tracking flag */
        prev_sw_down_edit = false;
    }

    if (b == BTN_NONE) return;
    refreshInactivityTimer();

    /* ================================
       GENERIC EDITING MODES
       ================================ */
    bool editing =
        (ui == UI_TIMER_EDIT_ON_TIME ||
         ui == UI_TIMER_EDIT_OFF_TIME ||
         ui == UI_TIMER_EDIT_GAP ||
         ui == UI_AUTO_EDIT_GAP ||
         ui == UI_AUTO_EDIT_MAXRUN ||
         ui == UI_AUTO_EDIT_RETRY ||
         ui == UI_TWIST_EDIT_ON ||
         ui == UI_TWIST_EDIT_OFF ||
         ui == UI_TWIST_EDIT_ON_H ||
         ui == UI_TWIST_EDIT_ON_M ||
         ui == UI_TWIST_EDIT_OFF_H ||
         ui == UI_TWIST_EDIT_OFF_M ||
         /* NOTE: UI_COUNTDOWN_EDIT_MIN is handled separately above */
         (ui >= UI_SETTINGS_GAP && ui <= UI_SETTINGS_FACTORY) ||
         ui == UI_DEVSET_EDIT_DATE ||
         ui == UI_DEVSET_EDIT_TIME ||
         ui == UI_DEVSET_EDIT_DAY);

    if (editing)
    {
        switch (b)
        {
            case BTN_UP:
                increase_edit_value();
                break;

            case BTN_DOWN:
                decrease_edit_value();
                break;

            case BTN_UP_LONG:
                last_repeat_time = now;
                increase_edit_value();
                break;

