Amiya200/stm32_water_tank/Core/Src/screen.c
            case BTN_DOWN_LONG:
                last_repeat_time = now;
                decrease_edit_value();
                break;

            case BTN_SELECT:

                /* TIMER editing uses linear flow via menu_select() */
                if (ui == UI_TIMER_EDIT_ON_TIME ||
                    ui == UI_TIMER_EDIT_OFF_TIME ||
                    ui == UI_TIMER_EDIT_GAP)
                {
                    menu_select();
                }
                /* SETTINGS from Device Setup: apply and go back to DEVSET menu */
                else if (ui >= UI_SETTINGS_GAP && ui <= UI_SETTINGS_MAXRUN)
                {
                    apply_settings_core();
                    ui = UI_DEVSET_MENU;
                }
                else if (ui == UI_SETTINGS_PWRREST)
                {
                    ModelHandle_SetPowerRestoreMode(edit_settings_pwrrest);
                    ui = UI_DEVSET_MENU;
                }
                else if (ui == UI_SETTINGS_FACTORY)
                {
                    if (edit_settings_factory_yes)
                        ModelHandle_FactoryReset();
                    ui = UI_DEVSET_MENU;
                }
                /* Device setup: Set Date */
                else if (ui == UI_DEVSET_EDIT_DATE)
                {
                    if (edit_date_field < 2)
                    {
                        edit_date_field++;  // DD -> MM -> YY
                    }
                    else
                    {
                        /* Finished editing → write to RTC */
                        RTC_GetTimeDate();

                        uint8_t sec   = time.sec;
                        uint8_t min   = time.min;
                        uint8_t hour  = time.hour;
                        uint8_t dow   = time.dow;
                        uint8_t dom   = edit_date_dd;
                        uint8_t month = edit_date_mm;
                        uint16_t year = edit_date_yyyy;

                        RTC_SetTimeDate(sec, min, hour, dow, dom, month, year);
                        RTC_GetTimeDate();

                        edit_date_field = 0;
                        ui = UI_DEVSET_MENU;
                    }
                }
                /* Device setup: Set Time */
                else if (ui == UI_DEVSET_EDIT_TIME)
                {
                    if (edit_time_field == 0)
                    {
                        edit_time_field = 1;   // HH -> MM
                    }
                    else
                    {
                        RTC_GetTimeDate();

                        uint8_t sec   = time.sec;
                        uint8_t dow   = time.dow;
                        uint8_t dom   = time.dom;
                        uint8_t month = time.month;
                        uint16_t year = time.year;

                        RTC_SetTimeDate(sec,
                                        edit_time_min,
                                        edit_time_hh,
                                        dow, dom, month, year);

                        RTC_GetTimeDate();

                        edit_time_field = 0;
                        ui = UI_DEVSET_MENU;
                    }
                }
                /* Device setup: Set Day */
                else if (ui == UI_DEVSET_EDIT_DAY)
                {
                    RTC_GetTimeDate();

                    uint8_t sec   = time.sec;
                    uint8_t min   = time.min;
                    uint8_t hour  = time.hour;
                    uint8_t dom   = time.dom;
                    uint8_t month = time.month;
                    uint16_t year = time.year;

                    /* DS1307 DOW 1..7 */
                    uint8_t dow   = (uint8_t)((edit_day_idx2 % 7) + 1);

                    RTC_SetTimeDate(sec, min, hour, dow, dom, month, year);
                    RTC_GetTimeDate();

                    ui = UI_DEVSET_MENU;
                }
                else
                {
                    /* Fallback: just go back to Device Setup menu */
                    ui = UI_DEVSET_MENU;
                }
                break;

            case BTN_RESET:
                if (ui >= UI_SETTINGS_GAP && ui <= UI_SETTINGS_FACTORY)
                {
                    ui = UI_DEVSET_MENU;
                }
                else if (ui == UI_DEVSET_EDIT_DATE ||
                         ui == UI_DEVSET_EDIT_TIME ||
                         ui == UI_DEVSET_EDIT_DAY)
                {
                    ui = UI_DEVSET_MENU;
                }
                else
                {
                    ui = UI_MENU;
                }
                break;

            default:
                break;
        }

        screenNeedsRefresh = true;
        return;
    }

    /* ===============================
       TIMER DAYS SELECTION
       =============================== */
    if (ui == UI_TIMER_EDIT_DAYS)
    {
        switch (b)
        {
            case BTN_UP:
            case BTN_UP_LONG:
                if (edit_day_index == 0) edit_day_index = 9;
                else edit_day_index--;
                break;

            case BTN_DOWN:
            case BTN_DOWN_LONG:
                edit_day_index = (edit_day_index + 1) % 10;
                break;

            case BTN_SELECT:
                if (edit_day_index == 0) edit_day_mask = 0x7F;     // Enable all
                else if (edit_day_index == 1) edit_day_mask = 0x00;// Disable all
                else if (edit_day_index >= 2 && edit_day_index <= 8)
                    edit_day_mask ^= (1 << (edit_day_index - 2));
                else if (edit_day_index == 9)
                    ui = UI_TIMER_EDIT_GAP;
                break;

            case BTN_RESET:
                ui = UI_TIMER_SLOT_SELECT;
                break;

            default:
                break;
        }

        screenNeedsRefresh = true;
        return;
    }

    /* ===============================
       TIMER ENABLE / DISABLE
       =============================== */
    if (ui == UI_TIMER_EDIT_ENABLE)
    {
        switch (b)
        {
            case BTN_UP:
            case BTN_UP_LONG:
                edit_slot_enabled = true;
                break;

            case BTN_DOWN:
            case BTN_DOWN_LONG:
                edit_slot_enabled = false;
                break;
            case BTN_SELECT:
                apply_timer_slot();
                ui = UI_TIMER_SLOT_SELECT;
                break;
            case BTN_RESET:
                ui = UI_TIMER_SLOT_SELECT;
                break;

            default:
                break;
        }

        screenNeedsRefresh = true;
        return;
    }

    /* ===============================
       ADD NEW DEVICE — MAIN MENU
       =============================== */
    if (ui == UI_ADD_DEVICE_MENU)
    {
        switch (b)
        {
            case BTN_UP:
            case BTN_UP_LONG:
                if (addDevMenuIndex > 0) addDevMenuIndex--;
                break;

            case BTN_DOWN:
            case BTN_DOWN_LONG:
                if (addDevMenuIndex < 1) addDevMenuIndex++;
                break;

            case BTN_SELECT:
            case BTN_SELECT_LONG:
                addDevTypeIndex = 0;
                if (addDevMenuIndex == 0)
                    ui = UI_ADD_DEVICE_PAIR;
                else
                    ui = UI_ADD_DEVICE_REMOVE;
                break;

            case BTN_RESET:
                ui = UI_MENU;
                break;

            default:
                break;
        }

        screenNeedsRefresh = true;
        return;
    }

    /* ADD NEW DEVICE — PAIR */
    if (ui == UI_ADD_DEVICE_PAIR)
    {
        switch (b)
        {
            case BTN_UP:
            case BTN_UP_LONG:
                if (addDevTypeIndex > 0) addDevTypeIndex--;
                break;

            case BTN_DOWN:
            case BTN_DOWN_LONG:
                if (addDevTypeIndex < 2) addDevTypeIndex++;
                break;

            case BTN_SELECT:
            case BTN_SELECT_LONG:
                lastAddActionPair = true;
                lastAddDevType = addDevTypeIndex;
                ui = UI_ADD_DEVICE_PAIR_DONE;
                break;

            case BTN_RESET:
                ui = UI_ADD_DEVICE_MENU;
                break;

            default:
                break;
        }

        screenNeedsRefresh = true;
        return;
    }

    /* ADD NEW DEVICE — REMOVE */
    if (ui == UI_ADD_DEVICE_REMOVE)
    {
        switch (b)
        {
            case BTN_UP:
            case BTN_UP_LONG:
                if (addDevTypeIndex > 0) addDevTypeIndex--;
                break;

            case BTN_DOWN:
            case BTN_DOWN_LONG:
                if (addDevTypeIndex < 2) addDevTypeIndex++;
                break;

            case BTN_SELECT:
            case BTN_SELECT_LONG:
                lastAddActionPair = false;
                lastAddDevType = addDevTypeIndex;
                ui = UI_ADD_DEVICE_REMOVE_DONE;
                break;

            case BTN_RESET:
                ui = UI_ADD_DEVICE_MENU;
                break;

            default:
                break;
        }

        screenNeedsRefresh = true;
        return;
    }

    /* ADD NEW DEVICE — DONE SCREENS */
    if (ui == UI_ADD_DEVICE_PAIR_DONE || ui == UI_ADD_DEVICE_REMOVE_DONE)
    {
        switch (b)
        {
            case BTN_SELECT:
            case BTN_SELECT_LONG:
            case BTN_RESET:
                ui = UI_ADD_DEVICE_MENU;
                break;
            default:
                break;
        }
        screenNeedsRefresh = true;
        return;
    }

    /* ===============================
       RESET TO DEFAULT CONFIRM
       =============================== */
    if (ui == UI_RESET_CONFIRM)
    {
        switch (b)
        {
            case BTN_UP:
            case BTN_UP_LONG:
                reset_confirm_yes = true;
                break;

            case BTN_DOWN:
            case BTN_DOWN_LONG:
                reset_confirm_yes = false;
                break;

            case BTN_SELECT:
            case BTN_SELECT_LONG:
                if (reset_confirm_yes)
                {
                    ModelHandle_FactoryReset();
                }
                ui = UI_DASH;
                break;

            case BTN_RESET:
                ui = UI_MENU;
                break;

            default:
                break;
        }

        screenNeedsRefresh = true;
        return;
    }

    /* ===============================
       DEVICE SETUP MENU (scroll)
       =============================== */
    /* ===============================
       DEVICE SETUP MENU (scroll + toggle)
       =============================== */
    if (ui == UI_DEVSET_MENU)
    {
        switch (b)
        {
            case BTN_UP:
            case BTN_UP_LONG:
                if (devset_idx > 0) devset_idx--;
                break;

            case BTN_DOWN:
            case BTN_DOWN_LONG:
                if (devset_idx < DEVSET_MENU_COUNT - 1) devset_idx++;
                break;

