Amiya200/stm32_water_tank/Core/Src/screen.c
            /* NORMAL SELECT → ENTER EDIT SCREEN */
            case BTN_SELECT:
                switch (devset_idx)
                {
                    case 0:  ui = UI_SETTINGS_GAP;        break;
                    case 1:  ui = UI_SETTINGS_RETRY;      break;
                    case 2:  ui = UI_SETTINGS_UV;         break;
                    case 3:  ui = UI_SETTINGS_OV;         break;
                    case 4:  ui = UI_SETTINGS_OL;         break;
                    case 5:  ui = UI_SETTINGS_UL;         break;
                    case 6:  ui = UI_SETTINGS_MAXRUN;     break;
                    case 7:  ui = UI_DEVSET_EDIT_DATE;    break;
                    case 8:  ui = UI_DEVSET_EDIT_TIME;    break;
                    case 9:  ui = UI_DEVSET_EDIT_DAY;     break;
                    case 10: ui = UI_SETTINGS_PWRREST;    break;
                    case 11: ui = UI_SETTINGS_FACTORY;    break;
                    case 12: ui = UI_MENU;                break;
                    default: break;
                }
                break;

            /* LONG SELECT → ENABLE / DISABLE TOGGLE */
            case BTN_SELECT_LONG:

                switch (devset_idx)
                {
                    case 0: /* Dry Run */
                        if (edit_settings_gap_s > 0) {
                            bk_gap = edit_settings_gap_s;
                            edit_settings_gap_s = 0;
                        } else {
                            edit_settings_gap_s = bk_gap ? bk_gap : 5;
                        }
                        break;

                    case 1: /* Testing Gap */
                        if (edit_settings_retry > 0) {
                            bk_retry = edit_settings_retry;
                            edit_settings_retry = 0;
                        } else {
                            edit_settings_retry = bk_retry ? bk_retry : 5;
                        }
                        break;

                    case 2: /* Low Volt */
                        if (edit_settings_uv > 0) {
                            bk_uv = edit_settings_uv;
                            edit_settings_uv = 0;
                        } else {
                            edit_settings_uv = bk_uv ? bk_uv : 180;
                        }
                        break;

                    case 3: /* High Volt */
                        if (edit_settings_ov > 0) {
                            bk_ov = edit_settings_ov;
                            edit_settings_ov = 0;
                        } else {
                            edit_settings_ov = bk_ov ? bk_ov : 260;
                        }
                        break;

                    case 4: /* Over Load */
                        if (edit_settings_ol > 0) {
                            bk_ol = edit_settings_ol;
                            edit_settings_ol = 0;
                        } else {
                            edit_settings_ol = bk_ol ? bk_ol : 5;
                        }
                        break;

                    case 5: /* Under Load */
                        if (edit_settings_ul > 0) {
                            bk_ul = edit_settings_ul;
                            edit_settings_ul = 0;
                        } else {
                            edit_settings_ul = bk_ul ? bk_ul : 2;
                        }
                        break;

                    case 6: /* Max Run */
                        if (edit_settings_maxrun > 0) {
                            bk_maxrun = edit_settings_maxrun;
                            edit_settings_maxrun = 0;
                        } else {
                            edit_settings_maxrun = bk_maxrun ? bk_maxrun : 60;
                        }
                        break;

                    default:
                        break;
                }

                apply_settings_core();
                break;

            case BTN_RESET:
                ui = UI_MENU;
                break;

            default:
                break;
        }

        screenNeedsRefresh = true;
        return;
    }

    /* ===============================
       MAIN MENU
       =============================== */
    if (ui == UI_MENU)
    {
        switch (b)
        {
            case BTN_UP:
                if (menu_idx > 0) menu_idx--;
                break;

            case BTN_DOWN:
                if (menu_idx < MAIN_MENU_COUNT - 1) menu_idx++;
                break;

            case BTN_SELECT:
            case BTN_SELECT_LONG:
                menu_select();
                break;

            case BTN_RESET:
                ui = UI_DASH;
                break;

            default:
                break;
        }
        screenNeedsRefresh = true;
        return;
    }

    /* ===============================
       TIMER SLOT SELECT
       =============================== */
    if (ui == UI_TIMER_SLOT_SELECT)
    {
        switch (b)
        {
            case BTN_UP:
                if (currentSlot > 0) currentSlot--;
                break;

            case BTN_DOWN:
                if (currentSlot < 5) currentSlot++;
                break;

            case BTN_SELECT:
            case BTN_SELECT_LONG:
                menu_select();
                break;

            case BTN_RESET:
                ui = UI_MENU;
                break;

            default:
                break;
        }

        timer_page = (currentSlot < 2 ? 0 :
                     (currentSlot < 5 ? 1 : 2));

        screenNeedsRefresh = true;
        return;
    }

    /* ===============================
       DASHBOARD BUTTON ACTIONS
       =============================== */
    switch (b)
    {
        case BTN_RESET:
            /* Restart pump / test-run */
            ModelHandle_ToggleManual();
            ui = UI_DASH;
            screenNeedsRefresh = true;
            return;

        case BTN_SELECT:
            /* Auto mode toggle from DASH */
            if (ui != UI_DASH) return;
            if (!autoActive)
                ModelHandle_StartAuto(edit_auto_gap_s, edit_auto_maxrun_min, edit_auto_retry);
            else
                ModelHandle_StopAuto();
            screenNeedsRefresh = true;
            return;

        case BTN_SELECT_LONG:
            /* Open Main Menu */
            ui = UI_MENU;
            menu_idx = 0;
            menu_view_top = 0;
            screenNeedsRefresh = true;
            return;

        case BTN_UP:
            /* Timer mode toggle (nearest slot) */
            if (!timerActive)
                ModelHandle_StartTimerNearestSlot();
            else
                ModelHandle_StopTimer();
            ui = UI_DASH;
            screenNeedsRefresh = true;
            return;

        case BTN_UP_LONG:
            /* Semi-auto toggle */
            if (!semiAutoActive)
                ModelHandle_StartSemiAuto();
            else
                ModelHandle_StopSemiAuto();
            ui = UI_DASH;
            screenNeedsRefresh = true;
            return;

        case BTN_DOWN:
            /* Countdown RUN / STOP */
            if (!countdownActive)
            {
                ModelHandle_StartCountdown(edit_countdown_min * 60);
                ui = UI_COUNTDOWN;
            }
            else
            {
                ModelHandle_StopCountdown();
                ui = UI_DASH;
            }
            screenNeedsRefresh = true;
            return;

